const questions = [

  // ===== 1-5 : E vs I =====
  {
    id: 1,
    a: "میرے تعلقات وسیع ہیں اور میں زیادہ تعلقات بنانا پسند کرتا ہوں۔",
    b: "میں اپنے تعلقات صرف مخصوص یا چند افراد تک ہی محدود رکھنا پسند کرتا ہوں۔",
    typeA: "E",
    typeB: "I"
  },

  {
    id: 2,
    a: "مجھے لوگوں سے گھلنا ملنا اور محفل جمانا اچھا لگتا ہے۔",
    b: "مجھے خاموشی اور تنہائی اچھی لگتی ہے۔",
    typeA: "E",
    typeB: "I"
  },

  {
    id: 3,
    a: "جب میں دوستوں کے ساتھ یا کسی محفل میں ہوں تو زیادہ تر بولنے کی خواہش رکھتا ہوں۔",
    b: "جب میں محفل میں ہوں تو زیادہ تر سننے کو ترجیح دیتا ہوں اور میں سننے کی بہترین صلاحیت رکھتا ہوں۔",
    typeA: "E",
    typeB: "I"
  },

  {
    id: 4,
    a: "اگر میں پورا دن کسی سے بات چیت نہ کروں تو بے چین رہتا ہوں اور چاہتا ہوں کہ کسی نہ کسی شخص سے بات کروں۔",
    b: "میں زیادہ لوگوں یا شور کے درمیان خود کو بے چین محسوس کرتا ہوں اور چاہتا ہوں کہ سب سے الگ ہو کر بیٹھوں۔",
    typeA: "E",
    typeB: "I"
  },

  {
    id: 5,
    a: "میں ہجوم میں رہ کر خود کو ایسے محسوس کرتا ہوں کہ جیسے مجھ میں انرجی آرہی ہے۔ لوگوں سے مل کر تازہ دم محسوس کرتا ہوں۔",
    b: "میں تنہائی میں کتاب پڑھنا، سوچنا یا مراقبہ کرنے سے خود میں انرجی محسوس کرتا ہوں۔",
    typeA: "E",
    typeB: "I"
  },

  // ===== 6-10 : N vs S =====
  {
    id: 6,
    a: "میں مستقبل کے بارے میں زیادہ سوچتا ہوں۔",
    b: "میں حال میں رہتا ہوں اور موجود لمحے پر توجہ دیتا ہوں۔",
    typeA: "N",
    typeB: "S"
  },

  {
    id: 7,
    a: "میں حالات کو معنی دیتا ہوں اور وجہ جاننے کی کوشش کرتا ہوں۔",
    b: "میں چیزوں کی ایک ایک جز پر توجہ دیتا ہوں۔",
    typeA: "N",
    typeB: "S"
  },

  {
    id: 8,
    a: "میں لانگ ٹرم منصوبہ بندی کرتا ہوں۔",
    b: "میں آج کے لئے فکر کرتا ہوں اور لانگ ٹرم پلاننگ سے بے زار ہوتا ہوں۔",
    typeA: "N",
    typeB: "S"
  },

  {
    id: 9,
    a: "مجھے نئے خیالات اور آئیڈیاز آتے ہیں۔",
    b: "میں چھوٹی چھوٹی چیزوں کو بھی محسوس کرتا ہوں۔",
    typeA: "N",
    typeB: "S"
  },

  {
    id: 10,
    a: "میں فلسفیانہ گفتگو میں دلچسپی رکھتا ہوں۔",
    b: "میں آج کو بہتر بنانے کی کوشش کرتا ہوں۔",
    typeA: "N",
    typeB: "S"
  },

  // ===== 11-15 : T vs F =====
  {
    id: 11,
    a: "میں فائدہ نقصان کی بنیاد پر قدم اٹھاتا ہوں۔",
    b: "میں تعلق کی بنیاد پر کام کرتا ہوں۔",
    typeA: "T",
    typeB: "F"
  },

  {
    id: 12,
    a: "میں ہر چیز کی وجہ ڈھونڈتا ہوں۔",
    b: "مجھے لوگوں کے جذبات کی پرواہ ہوتی ہے۔",
    typeA: "T",
    typeB: "F"
  },

  {
    id: 13,
    a: "مجھے ٹھوس دلیل چاہئے ہوتی ہے۔",
    b: "میں انتہائی حساس ہوں۔",
    typeA: "T",
    typeB: "F"
  },

  {
    id: 14,
    a: "میں حقیقی دنیا پسند کرتا ہوں۔",
    b: "مجھے کہانی اور شاعری سے لگاؤ ہے۔",
    typeA: "T",
    typeB: "F"
  },

  {
    id: 15,
    a: "میں اصولوں کی بنیاد پر چلتا ہوں۔",
    b: "میں نرم مزاج ہوں۔",
    typeA: "T",
    typeB: "F"
  },

  // ===== 16-20 : J vs P =====
  {
    id: 16,
    a: "میں ہمیشہ وقت کی پابندی کرتا ہوں۔",
    b: "وقت منظم کرنا مجھے بے زار کر دیتا ہے۔",
    typeA: "J",
    typeB: "P"
  },

  {
    id: 17,
    a: "میں ہر چیز ترتیب سے رکھتا ہوں۔",
    b: "میں حدود و قیود سے آزاد ہو کر کام کرتا ہوں۔",
    typeA: "J",
    typeB: "P"
  },

  {
    id: 18,
    a: "کام وقت پر نہ ہو تو کوفت ہوتی ہے۔",
    b: "میں وقت کی قید سے آزاد ہو کر بہترین کام کرتا ہوں۔",
    typeA: "J",
    typeB: "P"
  },

  {
    id: 19,
    a: "میں وقت سے پہلے پہنچنے کی فکر کرتا ہوں۔",
    b: "میں مقررہ وقت پر نہیں پہنچتا۔",
    typeA: "J",
    typeB: "P"
  },

  {
    id: 20,
    a: "میں نظم و ضبط کو اہمیت دیتا ہوں۔",
    b: "نظم و ضبط مجھے تناؤ دیتا ہے۔",
    typeA: "J",
    typeB: "P"
  }

];

export default questions;
